---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.Erase(Autodesk.Revit.DB.Electrical.WireType)
source: html/242d35c8-4f82-c3a9-2057-323e95728241.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.Erase Method

Removes a specified wire type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	WireType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireType`) - The wire type to be erased.

## Returns
The number of wire types that were erased from the set.